{
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
        "input_layers": [
            [
                "input_2",
                0,
                0
            ],
            [
                "input_3",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        170000
                    ],
                    "dtype": "float32",
                    "name": "input_2",
                    "ragged": false,
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_2"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_5",
                    "trainable": true,
                    "units": 1024,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_5"
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "axis": [
                        1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "name": "layer_normalization_3",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "layer_normalization_3"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_6",
                    "trainable": true,
                    "units": 512,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_6"
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "axis": [
                        1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "name": "layer_normalization_4",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "layer_normalization_4"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_7",
                    "trainable": true,
                    "units": 256,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_7"
            },
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        28
                    ],
                    "dtype": "float32",
                    "name": "input_3",
                    "ragged": false,
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_3"
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "axis": [
                        1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "name": "layer_normalization_5",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "layer_normalization_5"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAAAAAAEAAAACAAAAEwAAAHMIAAAAfACIABsAUwCpAU6pAKkB2gF4qQHaC3VwcGVy\nX2JvdW5kcgIAAAD6KS9ob21lL3lobGltL1B5Y2hhcm1Qcm9qZWN0cy9ERFBHL21vZGVsLnB52gg8\nbGFtYmRhPl0AAADzAAAAAA==\n",
                        null,
                        [
                            10
                        ]
                    ],
                    "function_type": "lambda",
                    "module": "model",
                    "name": "lambda_1",
                    "output_shape": null,
                    "output_shape_module": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_1"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_5",
                            0,
                            0,
                            {}
                        ],
                        [
                            "lambda_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_8",
                    "trainable": true,
                    "units": 256,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_8"
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "axis": [
                        1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "name": "layer_normalization_6",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "layer_normalization_6"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_9",
                    "trainable": true,
                    "units": 128,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_9"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_10",
                    "trainable": true,
                    "units": 1,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "dense_10"
            }
        ],
        "name": "model",
        "output_layers": [
            [
                "dense_10",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.4.0"
}